FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/gpio_reg.h
    __IO uint32_t MODE;    /*!< [0x00/0x40/0x80/0xC0/0x100/0x140/0x180/0x1C0] Port A-H I/O Mode Control                   */
    __IO uint32_t DINOFF;  /*!< [0x04/0x44/0x84/0xC4/0x104/0x144/0x184/0x1C4] Port A-H Digital Input Path Disable Control */
    __IO uint32_t DOUT;    /*!< [0x08/0x48/0x88/0xC8/0x108/0x148/0x188/0x1C8] Port A-H Data Output Value                  */
    __IO uint32_t DATMSK;  /*!< [0x0C/0x4C/0x8C/0xCC/0x10C/0x14C/0x18C/0x1CC] Port A-H Data Output Write Mask             */
    __I uint32_t PIN;      /*!< [0x10/0x50/0x90/0xD0/0x110/0x150/0x190/0x1D0] Port A-H Pin Value                          */
    __IO uint32_t DBEN;    /*!< [0x14/0x54/0x94/0xD4/0x114/0x154/0x194/0x1D4] Port A-H De-Bounce Enable Control           */
    __IO uint32_t INTTYPE; /*!< [0x18/0x58/0x98/0xD8/0x118/0x158/0x198/0x1D8] Port A-H Interrupt Trigger Type Control     */
    __IO uint32_t INTEN;   /*!< [0x1C/0x5C/0x9C/0xDC/0x11C/0x15C/0x19C/0x1DC] Port A-H Interrupt Enable Control           */
    __IO uint32_t INTSRC;  /*!< [0x20/0x60/0xA0/0xE0/0x120/0x160/0x1A0/0x1E0] Port A-H Interrupt Source Flag              */
    __IO uint32_t SMTEN;   /*!< [0x24/0x64/0xA4/0xE4/0x124/0x164/0x1A4/0x1E4] Port A-H Input Schmitt Trigger Enable       */
    __IO uint32_t SLEWCTL; /*!< [0x28/0x68/0xA8/0xE8/0x128/0x168/0x1A8/0x1E8] Port A-H High Slew Rate Control             */
    __I uint32_t RESERVE0[ 1 ];
    __IO uint32_t PUSEL;   /*!< [0x30/0x70/0xB0/0xF0/0x130/0x170/0x1B0/0x1F0] Port A-H Pull-up and Pull-down Selection Register */
    __IO uint32_t DBCTL;   /*!< [0x34/0x74/0xB4/0xF4/0x134/0x174/0x1B4/0x1F4] Port A-H Interrupt De-bounce Control        */
} GPIO_T;



/**
 *  @addtogroup GPIO_CONST GPIO Bit Field Definition
 *  Constant Definitions for GPIO Controller
 * @{ */

#define GPIO_MODE_MODE0_Pos         ( 0 )                                                  /*!< GPIO_T::MODE: MODE0 Position           */
#define GPIO_MODE_MODE0_Msk         ( 0x3ul << GPIO_MODE_MODE0_Pos )                       /*!< GPIO_T::MODE: MODE0 Mask               */

#define GPIO_MODE_MODE1_Pos         ( 2 )                                                  /*!< GPIO_T::MODE: MODE1 Position           */
#define GPIO_MODE_MODE1_Msk         ( 0x3ul << GPIO_MODE_MODE1_Pos )                       /*!< GPIO_T::MODE: MODE1 Mask               */

#define GPIO_MODE_MODE2_Pos         ( 4 )                                                  /*!< GPIO_T::MODE: MODE2 Position           */
#define GPIO_MODE_MODE2_Msk         ( 0x3ul << GPIO_MODE_MODE2_Pos )                       /*!< GPIO_T::MODE: MODE2 Mask               */

#define GPIO_MODE_MODE3_Pos         ( 6 )                                                  /*!< GPIO_T::MODE: MODE3 Position           */
#define GPIO_MODE_MODE3_Msk         ( 0x3ul << GPIO_MODE_MODE3_Pos )                       /*!< GPIO_T::MODE: MODE3 Mask               */

#define GPIO_MODE_MODE4_Pos         ( 8 )                                                  /*!< GPIO_T::MODE: MODE4 Position           */
#define GPIO_MODE_MODE4_Msk         ( 0x3ul << GPIO_MODE_MODE4_Pos )                       /*!< GPIO_T::MODE: MODE4 Mask               */

#define GPIO_MODE_MODE5_Pos         ( 10 )                                                 /*!< GPIO_T::MODE: MODE5 Position           */
#define GPIO_MODE_MODE5_Msk         ( 0x3ul << GPIO_MODE_MODE5_Pos )                       /*!< GPIO_T::MODE: MODE5 Mask               */

#define GPIO_MODE_MODE6_Pos         ( 12 )                                                 /*!< GPIO_T::MODE: MODE6 Position           */
#define GPIO_MODE_MODE6_Msk         ( 0x3ul << GPIO_MODE_MODE6_Pos )                       /*!< GPIO_T::MODE: MODE6 Mask               */

#define GPIO_MODE_MODE7_Pos         ( 14 )                                                 /*!< GPIO_T::MODE: MODE7 Position           */
#define GPIO_MODE_MODE7_Msk         ( 0x3ul << GPIO_MODE_MODE7_Pos )                       /*!< GPIO_T::MODE: MODE7 Mask               */

#define GPIO_MODE_MODE8_Pos         ( 16 )                                                 /*!< GPIO_T::MODE: MODE8 Position           */
#define GPIO_MODE_MODE8_Msk         ( 0x3ul << GPIO_MODE_MODE8_Pos )                       /*!< GPIO_T::MODE: MODE8 Mask               */

#define GPIO_MODE_MODE9_Pos         ( 18 )                                                 /*!< GPIO_T::MODE: MODE9 Position           */
#define GPIO_MODE_MODE9_Msk         ( 0x3ul << GPIO_MODE_MODE9_Pos )                       /*!< GPIO_T::MODE: MODE9 Mask               */

#define GPIO_MODE_MODE10_Pos        ( 20 )                                                 /*!< GPIO_T::MODE: MODE10 Position          */
#define GPIO_MODE_MODE10_Msk        ( 0x3ul << GPIO_MODE_MODE10_Pos )                      /*!< GPIO_T::MODE: MODE10 Mask              */

#define GPIO_MODE_MODE11_Pos        ( 22 )                                                 /*!< GPIO_T::MODE: MODE11 Position          */
#define GPIO_MODE_MODE11_Msk        ( 0x3ul << GPIO_MODE_MODE11_Pos )                      /*!< GPIO_T::MODE: MODE11 Mask              */

#define GPIO_MODE_MODE12_Pos        ( 24 )                                                 /*!< GPIO_T::MODE: MODE12 Position          */
#define GPIO_MODE_MODE12_Msk        ( 0x3ul << GPIO_MODE_MODE12_Pos )                      /*!< GPIO_T::MODE: MODE12 Mask              */

#define GPIO_MODE_MODE13_Pos        ( 26 )                                                 /*!< GPIO_T::MODE: MODE13 Position          */
#define GPIO_MODE_MODE13_Msk        ( 0x3ul << GPIO_MODE_MODE13_Pos )                      /*!< GPIO_T::MODE: MODE13 Mask              */

#define GPIO_MODE_MODE14_Pos        ( 28 )                                                 /*!< GPIO_T::MODE: MODE14 Position          */
#define GPIO_MODE_MODE14_Msk        ( 0x3ul << GPIO_MODE_MODE14_Pos )                      /*!< GPIO_T::MODE: MODE14 Mask              */

#define GPIO_MODE_MODE15_Pos        ( 30 )                                                 /*!< GPIO_T::MODE: MODE15 Position          */
#define GPIO_MODE_MODE15_Msk        ( 0x3ul << GPIO_MODE_MODE15_Pos )                      /*!< GPIO_T::MODE: MODE15 Mask              */

#define GPIO_DINOFF_DINOFF0_Pos     ( 16 )                                                 /*!< GPIO_T::DINOFF: DINOFF0 Position       */
#define GPIO_DINOFF_DINOFF0_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF0_Pos )                   /*!< GPIO_T::DINOFF: DINOFF0 Mask           */

#define GPIO_DINOFF_DINOFF1_Pos     ( 17 )                                                 /*!< GPIO_T::DINOFF: DINOFF1 Position       */
#define GPIO_DINOFF_DINOFF1_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF1_Pos )                   /*!< GPIO_T::DINOFF: DINOFF1 Mask           */

#define GPIO_DINOFF_DINOFF2_Pos     ( 18 )                                                 /*!< GPIO_T::DINOFF: DINOFF2 Position       */
#define GPIO_DINOFF_DINOFF2_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF2_Pos )                   /*!< GPIO_T::DINOFF: DINOFF2 Mask           */

#define GPIO_DINOFF_DINOFF3_Pos     ( 19 )                                                 /*!< GPIO_T::DINOFF: DINOFF3 Position       */
#define GPIO_DINOFF_DINOFF3_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF3_Pos )                   /*!< GPIO_T::DINOFF: DINOFF3 Mask           */

#define GPIO_DINOFF_DINOFF4_Pos     ( 20 )                                                 /*!< GPIO_T::DINOFF: DINOFF4 Position       */
#define GPIO_DINOFF_DINOFF4_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF4_Pos )                   /*!< GPIO_T::DINOFF: DINOFF4 Mask           */

#define GPIO_DINOFF_DINOFF5_Pos     ( 21 )                                                 /*!< GPIO_T::DINOFF: DINOFF5 Position       */
#define GPIO_DINOFF_DINOFF5_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF5_Pos )                   /*!< GPIO_T::DINOFF: DINOFF5 Mask           */

#define GPIO_DINOFF_DINOFF6_Pos     ( 22 )                                                 /*!< GPIO_T::DINOFF: DINOFF6 Position       */
#define GPIO_DINOFF_DINOFF6_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF6_Pos )                   /*!< GPIO_T::DINOFF: DINOFF6 Mask           */

