FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/gpio_reg.h
#define GPIO_DINOFF_DINOFF7_Pos     ( 23 )                                                 /*!< GPIO_T::DINOFF: DINOFF7 Position       */
#define GPIO_DINOFF_DINOFF7_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF7_Pos )                   /*!< GPIO_T::DINOFF: DINOFF7 Mask           */

#define GPIO_DINOFF_DINOFF8_Pos     ( 24 )                                                 /*!< GPIO_T::DINOFF: DINOFF8 Position       */
#define GPIO_DINOFF_DINOFF8_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF8_Pos )                   /*!< GPIO_T::DINOFF: DINOFF8 Mask           */

#define GPIO_DINOFF_DINOFF9_Pos     ( 25 )                                                 /*!< GPIO_T::DINOFF: DINOFF9 Position       */
#define GPIO_DINOFF_DINOFF9_Msk     ( 0x1ul << GPIO_DINOFF_DINOFF9_Pos )                   /*!< GPIO_T::DINOFF: DINOFF9 Mask           */

#define GPIO_DINOFF_DINOFF10_Pos    ( 26 )                                                 /*!< GPIO_T::DINOFF: DINOFF10 Position      */
#define GPIO_DINOFF_DINOFF10_Msk    ( 0x1ul << GPIO_DINOFF_DINOFF10_Pos )                  /*!< GPIO_T::DINOFF: DINOFF10 Mask          */

#define GPIO_DINOFF_DINOFF11_Pos    ( 27 )                                                 /*!< GPIO_T::DINOFF: DINOFF11 Position      */
#define GPIO_DINOFF_DINOFF11_Msk    ( 0x1ul << GPIO_DINOFF_DINOFF11_Pos )                  /*!< GPIO_T::DINOFF: DINOFF11 Mask          */

#define GPIO_DINOFF_DINOFF12_Pos    ( 28 )                                                 /*!< GPIO_T::DINOFF: DINOFF12 Position      */
#define GPIO_DINOFF_DINOFF12_Msk    ( 0x1ul << GPIO_DINOFF_DINOFF12_Pos )                  /*!< GPIO_T::DINOFF: DINOFF12 Mask          */

#define GPIO_DINOFF_DINOFF13_Pos    ( 29 )                                                 /*!< GPIO_T::DINOFF: DINOFF13 Position      */
#define GPIO_DINOFF_DINOFF13_Msk    ( 0x1ul << GPIO_DINOFF_DINOFF13_Pos )                  /*!< GPIO_T::DINOFF: DINOFF13 Mask          */

#define GPIO_DINOFF_DINOFF14_Pos    ( 30 )                                                 /*!< GPIO_T::DINOFF: DINOFF14 Position      */
#define GPIO_DINOFF_DINOFF14_Msk    ( 0x1ul << GPIO_DINOFF_DINOFF14_Pos )                  /*!< GPIO_T::DINOFF: DINOFF14 Mask          */

#define GPIO_DINOFF_DINOFF15_Pos    ( 31 )                                                 /*!< GPIO_T::DINOFF: DINOFF15 Position      */
#define GPIO_DINOFF_DINOFF15_Msk    ( 0x1ul << GPIO_DINOFF_DINOFF15_Pos )                  /*!< GPIO_T::DINOFF: DINOFF15 Mask          */

#define GPIO_DOUT_DOUT0_Pos         ( 0 )                                                  /*!< GPIO_T::DOUT: DOUT0 Position           */
#define GPIO_DOUT_DOUT0_Msk         ( 0x1ul << GPIO_DOUT_DOUT0_Pos )                       /*!< GPIO_T::DOUT: DOUT0 Mask               */

#define GPIO_DOUT_DOUT1_Pos         ( 1 )                                                  /*!< GPIO_T::DOUT: DOUT1 Position           */
#define GPIO_DOUT_DOUT1_Msk         ( 0x1ul << GPIO_DOUT_DOUT1_Pos )                       /*!< GPIO_T::DOUT: DOUT1 Mask               */

#define GPIO_DOUT_DOUT2_Pos         ( 2 )                                                  /*!< GPIO_T::DOUT: DOUT2 Position           */
#define GPIO_DOUT_DOUT2_Msk         ( 0x1ul << GPIO_DOUT_DOUT2_Pos )                       /*!< GPIO_T::DOUT: DOUT2 Mask               */

#define GPIO_DOUT_DOUT3_Pos         ( 3 )                                                  /*!< GPIO_T::DOUT: DOUT3 Position           */
#define GPIO_DOUT_DOUT3_Msk         ( 0x1ul << GPIO_DOUT_DOUT3_Pos )                       /*!< GPIO_T::DOUT: DOUT3 Mask               */

#define GPIO_DOUT_DOUT4_Pos         ( 4 )                                                  /*!< GPIO_T::DOUT: DOUT4 Position           */
#define GPIO_DOUT_DOUT4_Msk         ( 0x1ul << GPIO_DOUT_DOUT4_Pos )                       /*!< GPIO_T::DOUT: DOUT4 Mask               */

#define GPIO_DOUT_DOUT5_Pos         ( 5 )                                                  /*!< GPIO_T::DOUT: DOUT5 Position           */
#define GPIO_DOUT_DOUT5_Msk         ( 0x1ul << GPIO_DOUT_DOUT5_Pos )                       /*!< GPIO_T::DOUT: DOUT5 Mask               */

#define GPIO_DOUT_DOUT6_Pos         ( 6 )                                                  /*!< GPIO_T::DOUT: DOUT6 Position           */
#define GPIO_DOUT_DOUT6_Msk         ( 0x1ul << GPIO_DOUT_DOUT6_Pos )                       /*!< GPIO_T::DOUT: DOUT6 Mask               */

#define GPIO_DOUT_DOUT7_Pos         ( 7 )                                                  /*!< GPIO_T::DOUT: DOUT7 Position           */
#define GPIO_DOUT_DOUT7_Msk         ( 0x1ul << GPIO_DOUT_DOUT7_Pos )                       /*!< GPIO_T::DOUT: DOUT7 Mask               */

#define GPIO_DOUT_DOUT8_Pos         ( 8 )                                                  /*!< GPIO_T::DOUT: DOUT8 Position           */
#define GPIO_DOUT_DOUT8_Msk         ( 0x1ul << GPIO_DOUT_DOUT8_Pos )                       /*!< GPIO_T::DOUT: DOUT8 Mask               */

#define GPIO_DOUT_DOUT9_Pos         ( 9 )                                                  /*!< GPIO_T::DOUT: DOUT9 Position           */
#define GPIO_DOUT_DOUT9_Msk         ( 0x1ul << GPIO_DOUT_DOUT9_Pos )                       /*!< GPIO_T::DOUT: DOUT9 Mask               */

#define GPIO_DOUT_DOUT10_Pos        ( 10 )                                                 /*!< GPIO_T::DOUT: DOUT10 Position          */
#define GPIO_DOUT_DOUT10_Msk        ( 0x1ul << GPIO_DOUT_DOUT10_Pos )                      /*!< GPIO_T::DOUT: DOUT10 Mask              */

#define GPIO_DOUT_DOUT11_Pos        ( 11 )                                                 /*!< GPIO_T::DOUT: DOUT11 Position          */
#define GPIO_DOUT_DOUT11_Msk        ( 0x1ul << GPIO_DOUT_DOUT11_Pos )                      /*!< GPIO_T::DOUT: DOUT11 Mask              */

#define GPIO_DOUT_DOUT12_Pos        ( 12 )                                                 /*!< GPIO_T::DOUT: DOUT12 Position          */
#define GPIO_DOUT_DOUT12_Msk        ( 0x1ul << GPIO_DOUT_DOUT12_Pos )                      /*!< GPIO_T::DOUT: DOUT12 Mask              */

#define GPIO_DOUT_DOUT13_Pos        ( 13 )                                                 /*!< GPIO_T::DOUT: DOUT13 Position          */
#define GPIO_DOUT_DOUT13_Msk        ( 0x1ul << GPIO_DOUT_DOUT13_Pos )                      /*!< GPIO_T::DOUT: DOUT13 Mask              */

#define GPIO_DOUT_DOUT14_Pos        ( 14 )                                                 /*!< GPIO_T::DOUT: DOUT14 Position          */
#define GPIO_DOUT_DOUT14_Msk        ( 0x1ul << GPIO_DOUT_DOUT14_Pos )                      /*!< GPIO_T::DOUT: DOUT14 Mask              */

#define GPIO_DOUT_DOUT15_Pos        ( 15 )                                                 /*!< GPIO_T::DOUT: DOUT15 Position          */
#define GPIO_DOUT_DOUT15_Msk        ( 0x1ul << GPIO_DOUT_DOUT15_Pos )                      /*!< GPIO_T::DOUT: DOUT15 Mask              */

#define GPIO_DATMSK_DATMSK0_Pos     ( 0 )                                                  /*!< GPIO_T::DATMSK: DATMSK0 Position       */
#define GPIO_DATMSK_DATMSK0_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK0_Pos )                   /*!< GPIO_T::DATMSK: DATMSK0 Mask           */

#define GPIO_DATMSK_DATMSK1_Pos     ( 1 )                                                  /*!< GPIO_T::DATMSK: DATMSK1 Position       */
#define GPIO_DATMSK_DATMSK1_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK1_Pos )                   /*!< GPIO_T::DATMSK: DATMSK1 Mask           */

#define GPIO_DATMSK_DATMSK2_Pos     ( 2 )                                                  /*!< GPIO_T::DATMSK: DATMSK2 Position       */
#define GPIO_DATMSK_DATMSK2_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK2_Pos )                   /*!< GPIO_T::DATMSK: DATMSK2 Mask           */

#define GPIO_DATMSK_DATMSK3_Pos     ( 3 )                                                  /*!< GPIO_T::DATMSK: DATMSK3 Position       */
#define GPIO_DATMSK_DATMSK3_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK3_Pos )                   /*!< GPIO_T::DATMSK: DATMSK3 Mask           */

#define GPIO_DATMSK_DATMSK4_Pos     ( 4 )                                                  /*!< GPIO_T::DATMSK: DATMSK4 Position       */
#define GPIO_DATMSK_DATMSK4_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK4_Pos )                   /*!< GPIO_T::DATMSK: DATMSK4 Mask           */

#define GPIO_DATMSK_DATMSK5_Pos     ( 5 )                                                  /*!< GPIO_T::DATMSK: DATMSK5 Position       */
#define GPIO_DATMSK_DATMSK5_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK5_Pos )                   /*!< GPIO_T::DATMSK: DATMSK5 Mask           */

