FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/gpio_reg.h
#define GPIO_DATMSK_DATMSK6_Pos     ( 6 )                                                  /*!< GPIO_T::DATMSK: DATMSK6 Position       */
#define GPIO_DATMSK_DATMSK6_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK6_Pos )                   /*!< GPIO_T::DATMSK: DATMSK6 Mask           */

#define GPIO_DATMSK_DATMSK7_Pos     ( 7 )                                                  /*!< GPIO_T::DATMSK: DATMSK7 Position       */
#define GPIO_DATMSK_DATMSK7_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK7_Pos )                   /*!< GPIO_T::DATMSK: DATMSK7 Mask           */

#define GPIO_DATMSK_DATMSK8_Pos     ( 8 )                                                  /*!< GPIO_T::DATMSK: DATMSK8 Position       */
#define GPIO_DATMSK_DATMSK8_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK8_Pos )                   /*!< GPIO_T::DATMSK: DATMSK8 Mask           */

#define GPIO_DATMSK_DATMSK9_Pos     ( 9 )                                                  /*!< GPIO_T::DATMSK: DATMSK9 Position       */
#define GPIO_DATMSK_DATMSK9_Msk     ( 0x1ul << GPIO_DATMSK_DATMSK9_Pos )                   /*!< GPIO_T::DATMSK: DATMSK9 Mask           */

#define GPIO_DATMSK_DATMSK10_Pos    ( 10 )                                                 /*!< GPIO_T::DATMSK: DATMSK10 Position      */
#define GPIO_DATMSK_DATMSK10_Msk    ( 0x1ul << GPIO_DATMSK_DATMSK10_Pos )                  /*!< GPIO_T::DATMSK: DATMSK10 Mask          */

#define GPIO_DATMSK_DATMSK11_Pos    ( 11 )                                                 /*!< GPIO_T::DATMSK: DATMSK11 Position      */
#define GPIO_DATMSK_DATMSK11_Msk    ( 0x1ul << GPIO_DATMSK_DATMSK11_Pos )                  /*!< GPIO_T::DATMSK: DATMSK11 Mask          */

#define GPIO_DATMSK_DATMSK12_Pos    ( 12 )                                                 /*!< GPIO_T::DATMSK: DATMSK12 Position      */
#define GPIO_DATMSK_DATMSK12_Msk    ( 0x1ul << GPIO_DATMSK_DATMSK12_Pos )                  /*!< GPIO_T::DATMSK: DATMSK12 Mask          */

#define GPIO_DATMSK_DATMSK13_Pos    ( 13 )                                                 /*!< GPIO_T::DATMSK: DATMSK13 Position      */
#define GPIO_DATMSK_DATMSK13_Msk    ( 0x1ul << GPIO_DATMSK_DATMSK13_Pos )                  /*!< GPIO_T::DATMSK: DATMSK13 Mask          */

#define GPIO_DATMSK_DATMSK14_Pos    ( 14 )                                                 /*!< GPIO_T::DATMSK: DATMSK14 Position      */
#define GPIO_DATMSK_DATMSK14_Msk    ( 0x1ul << GPIO_DATMSK_DATMSK14_Pos )                  /*!< GPIO_T::DATMSK: DATMSK14 Mask          */

#define GPIO_DATMSK_DATMSK15_Pos    ( 15 )                                                 /*!< GPIO_T::DATMSK: DATMSK15 Position      */
#define GPIO_DATMSK_DATMSK15_Msk    ( 0x1ul << GPIO_DATMSK_DATMSK15_Pos )                  /*!< GPIO_T::DATMSK: DATMSK15 Mask          */

#define GPIO_PIN_PIN0_Pos           ( 0 )                                                  /*!< GPIO_T::PIN: PIN0 Position             */
#define GPIO_PIN_PIN0_Msk           ( 0x1ul << GPIO_PIN_PIN0_Pos )                         /*!< GPIO_T::PIN: PIN0 Mask                 */

#define GPIO_PIN_PIN1_Pos           ( 1 )                                                  /*!< GPIO_T::PIN: PIN1 Position             */
#define GPIO_PIN_PIN1_Msk           ( 0x1ul << GPIO_PIN_PIN1_Pos )                         /*!< GPIO_T::PIN: PIN1 Mask                 */

#define GPIO_PIN_PIN2_Pos           ( 2 )                                                  /*!< GPIO_T::PIN: PIN2 Position             */
#define GPIO_PIN_PIN2_Msk           ( 0x1ul << GPIO_PIN_PIN2_Pos )                         /*!< GPIO_T::PIN: PIN2 Mask                 */

#define GPIO_PIN_PIN3_Pos           ( 3 )                                                  /*!< GPIO_T::PIN: PIN3 Position             */
#define GPIO_PIN_PIN3_Msk           ( 0x1ul << GPIO_PIN_PIN3_Pos )                         /*!< GPIO_T::PIN: PIN3 Mask                 */

#define GPIO_PIN_PIN4_Pos           ( 4 )                                                  /*!< GPIO_T::PIN: PIN4 Position             */
#define GPIO_PIN_PIN4_Msk           ( 0x1ul << GPIO_PIN_PIN4_Pos )                         /*!< GPIO_T::PIN: PIN4 Mask                 */

#define GPIO_PIN_PIN5_Pos           ( 5 )                                                  /*!< GPIO_T::PIN: PIN5 Position             */
#define GPIO_PIN_PIN5_Msk           ( 0x1ul << GPIO_PIN_PIN5_Pos )                         /*!< GPIO_T::PIN: PIN5 Mask                 */

#define GPIO_PIN_PIN6_Pos           ( 6 )                                                  /*!< GPIO_T::PIN: PIN6 Position             */
#define GPIO_PIN_PIN6_Msk           ( 0x1ul << GPIO_PIN_PIN6_Pos )                         /*!< GPIO_T::PIN: PIN6 Mask                 */

#define GPIO_PIN_PIN7_Pos           ( 7 )                                                  /*!< GPIO_T::PIN: PIN7 Position             */
#define GPIO_PIN_PIN7_Msk           ( 0x1ul << GPIO_PIN_PIN7_Pos )                         /*!< GPIO_T::PIN: PIN7 Mask                 */

#define GPIO_PIN_PIN8_Pos           ( 8 )                                                  /*!< GPIO_T::PIN: PIN8 Position             */
#define GPIO_PIN_PIN8_Msk           ( 0x1ul << GPIO_PIN_PIN8_Pos )                         /*!< GPIO_T::PIN: PIN8 Mask                 */

#define GPIO_PIN_PIN9_Pos           ( 9 )                                                  /*!< GPIO_T::PIN: PIN9 Position             */
#define GPIO_PIN_PIN9_Msk           ( 0x1ul << GPIO_PIN_PIN9_Pos )                         /*!< GPIO_T::PIN: PIN9 Mask                 */

#define GPIO_PIN_PIN10_Pos          ( 10 )                                                 /*!< GPIO_T::PIN: PIN10 Position            */
#define GPIO_PIN_PIN10_Msk          ( 0x1ul << GPIO_PIN_PIN10_Pos )                        /*!< GPIO_T::PIN: PIN10 Mask                */

#define GPIO_PIN_PIN11_Pos          ( 11 )                                                 /*!< GPIO_T::PIN: PIN11 Position            */
#define GPIO_PIN_PIN11_Msk          ( 0x1ul << GPIO_PIN_PIN11_Pos )                        /*!< GPIO_T::PIN: PIN11 Mask                */

#define GPIO_PIN_PIN12_Pos          ( 12 )                                                 /*!< GPIO_T::PIN: PIN12 Position            */
#define GPIO_PIN_PIN12_Msk          ( 0x1ul << GPIO_PIN_PIN12_Pos )                        /*!< GPIO_T::PIN: PIN12 Mask                */

#define GPIO_PIN_PIN13_Pos          ( 13 )                                                 /*!< GPIO_T::PIN: PIN13 Position            */
#define GPIO_PIN_PIN13_Msk          ( 0x1ul << GPIO_PIN_PIN13_Pos )                        /*!< GPIO_T::PIN: PIN13 Mask                */

#define GPIO_PIN_PIN14_Pos          ( 14 )                                                 /*!< GPIO_T::PIN: PIN14 Position            */
#define GPIO_PIN_PIN14_Msk          ( 0x1ul << GPIO_PIN_PIN14_Pos )                        /*!< GPIO_T::PIN: PIN14 Mask                */

#define GPIO_PIN_PIN15_Pos          ( 15 )                                                 /*!< GPIO_T::PIN: PIN15 Position            */
#define GPIO_PIN_PIN15_Msk          ( 0x1ul << GPIO_PIN_PIN15_Pos )                        /*!< GPIO_T::PIN: PIN15 Mask                */

