FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/gpio_reg.h
#define GPIO_DBEN_DBEN0_Pos         ( 0 )                                                  /*!< GPIO_T::DBEN: DBEN0 Position           */
#define GPIO_DBEN_DBEN0_Msk         ( 0x1ul << GPIO_DBEN_DBEN0_Pos )                       /*!< GPIO_T::DBEN: DBEN0 Mask               */

#define GPIO_DBEN_DBEN1_Pos         ( 1 )                                                  /*!< GPIO_T::DBEN: DBEN1 Position           */
#define GPIO_DBEN_DBEN1_Msk         ( 0x1ul << GPIO_DBEN_DBEN1_Pos )                       /*!< GPIO_T::DBEN: DBEN1 Mask               */

#define GPIO_DBEN_DBEN2_Pos         ( 2 )                                                  /*!< GPIO_T::DBEN: DBEN2 Position           */
#define GPIO_DBEN_DBEN2_Msk         ( 0x1ul << GPIO_DBEN_DBEN2_Pos )                       /*!< GPIO_T::DBEN: DBEN2 Mask               */

#define GPIO_DBEN_DBEN3_Pos         ( 3 )                                                  /*!< GPIO_T::DBEN: DBEN3 Position           */
#define GPIO_DBEN_DBEN3_Msk         ( 0x1ul << GPIO_DBEN_DBEN3_Pos )                       /*!< GPIO_T::DBEN: DBEN3 Mask               */

#define GPIO_DBEN_DBEN4_Pos         ( 4 )                                                  /*!< GPIO_T::DBEN: DBEN4 Position           */
#define GPIO_DBEN_DBEN4_Msk         ( 0x1ul << GPIO_DBEN_DBEN4_Pos )                       /*!< GPIO_T::DBEN: DBEN4 Mask               */

#define GPIO_DBEN_DBEN5_Pos         ( 5 )                                                  /*!< GPIO_T::DBEN: DBEN5 Position           */
#define GPIO_DBEN_DBEN5_Msk         ( 0x1ul << GPIO_DBEN_DBEN5_Pos )                       /*!< GPIO_T::DBEN: DBEN5 Mask               */

#define GPIO_DBEN_DBEN6_Pos         ( 6 )                                                  /*!< GPIO_T::DBEN: DBEN6 Position           */
#define GPIO_DBEN_DBEN6_Msk         ( 0x1ul << GPIO_DBEN_DBEN6_Pos )                       /*!< GPIO_T::DBEN: DBEN6 Mask               */

#define GPIO_DBEN_DBEN7_Pos         ( 7 )                                                  /*!< GPIO_T::DBEN: DBEN7 Position           */
#define GPIO_DBEN_DBEN7_Msk         ( 0x1ul << GPIO_DBEN_DBEN7_Pos )                       /*!< GPIO_T::DBEN: DBEN7 Mask               */

#define GPIO_DBEN_DBEN8_Pos         ( 8 )                                                  /*!< GPIO_T::DBEN: DBEN8 Position           */
#define GPIO_DBEN_DBEN8_Msk         ( 0x1ul << GPIO_DBEN_DBEN8_Pos )                       /*!< GPIO_T::DBEN: DBEN8 Mask               */

#define GPIO_DBEN_DBEN9_Pos         ( 9 )                                                  /*!< GPIO_T::DBEN: DBEN9 Position           */
#define GPIO_DBEN_DBEN9_Msk         ( 0x1ul << GPIO_DBEN_DBEN9_Pos )                       /*!< GPIO_T::DBEN: DBEN9 Mask               */

#define GPIO_DBEN_DBEN10_Pos        ( 10 )                                                 /*!< GPIO_T::DBEN: DBEN10 Position          */
#define GPIO_DBEN_DBEN10_Msk        ( 0x1ul << GPIO_DBEN_DBEN10_Pos )                      /*!< GPIO_T::DBEN: DBEN10 Mask              */

#define GPIO_DBEN_DBEN11_Pos        ( 11 )                                                 /*!< GPIO_T::DBEN: DBEN11 Position          */
#define GPIO_DBEN_DBEN11_Msk        ( 0x1ul << GPIO_DBEN_DBEN11_Pos )                      /*!< GPIO_T::DBEN: DBEN11 Mask              */

#define GPIO_DBEN_DBEN12_Pos        ( 12 )                                                 /*!< GPIO_T::DBEN: DBEN12 Position          */
#define GPIO_DBEN_DBEN12_Msk        ( 0x1ul << GPIO_DBEN_DBEN12_Pos )                      /*!< GPIO_T::DBEN: DBEN12 Mask              */

#define GPIO_DBEN_DBEN13_Pos        ( 13 )                                                 /*!< GPIO_T::DBEN: DBEN13 Position          */
#define GPIO_DBEN_DBEN13_Msk        ( 0x1ul << GPIO_DBEN_DBEN13_Pos )                      /*!< GPIO_T::DBEN: DBEN13 Mask              */

#define GPIO_DBEN_DBEN14_Pos        ( 14 )                                                 /*!< GPIO_T::DBEN: DBEN14 Position          */
#define GPIO_DBEN_DBEN14_Msk        ( 0x1ul << GPIO_DBEN_DBEN14_Pos )                      /*!< GPIO_T::DBEN: DBEN14 Mask              */

#define GPIO_DBEN_DBEN15_Pos        ( 15 )                                                 /*!< GPIO_T::DBEN: DBEN15 Position          */
#define GPIO_DBEN_DBEN15_Msk        ( 0x1ul << GPIO_DBEN_DBEN15_Pos )                      /*!< GPIO_T::DBEN: DBEN15 Mask              */

#define GPIO_INTTYPE_TYPE0_Pos      ( 0 )                                                  /*!< GPIO_T::INTTYPE: TYPE0 Position        */
#define GPIO_INTTYPE_TYPE0_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE0_Pos )                    /*!< GPIO_T::INTTYPE: TYPE0 Mask            */

#define GPIO_INTTYPE_TYPE1_Pos      ( 1 )                                                  /*!< GPIO_T::INTTYPE: TYPE1 Position        */
#define GPIO_INTTYPE_TYPE1_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE1_Pos )                    /*!< GPIO_T::INTTYPE: TYPE1 Mask            */

#define GPIO_INTTYPE_TYPE2_Pos      ( 2 )                                                  /*!< GPIO_T::INTTYPE: TYPE2 Position        */
#define GPIO_INTTYPE_TYPE2_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE2_Pos )                    /*!< GPIO_T::INTTYPE: TYPE2 Mask            */

#define GPIO_INTTYPE_TYPE3_Pos      ( 3 )                                                  /*!< GPIO_T::INTTYPE: TYPE3 Position        */
#define GPIO_INTTYPE_TYPE3_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE3_Pos )                    /*!< GPIO_T::INTTYPE: TYPE3 Mask            */

#define GPIO_INTTYPE_TYPE4_Pos      ( 4 )                                                  /*!< GPIO_T::INTTYPE: TYPE4 Position        */
#define GPIO_INTTYPE_TYPE4_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE4_Pos )                    /*!< GPIO_T::INTTYPE: TYPE4 Mask            */

#define GPIO_INTTYPE_TYPE5_Pos      ( 5 )                                                  /*!< GPIO_T::INTTYPE: TYPE5 Position        */
#define GPIO_INTTYPE_TYPE5_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE5_Pos )                    /*!< GPIO_T::INTTYPE: TYPE5 Mask            */

#define GPIO_INTTYPE_TYPE6_Pos      ( 6 )                                                  /*!< GPIO_T::INTTYPE: TYPE6 Position        */
#define GPIO_INTTYPE_TYPE6_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE6_Pos )                    /*!< GPIO_T::INTTYPE: TYPE6 Mask            */

#define GPIO_INTTYPE_TYPE7_Pos      ( 7 )                                                  /*!< GPIO_T::INTTYPE: TYPE7 Position        */
#define GPIO_INTTYPE_TYPE7_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE7_Pos )                    /*!< GPIO_T::INTTYPE: TYPE7 Mask            */

#define GPIO_INTTYPE_TYPE8_Pos      ( 8 )                                                  /*!< GPIO_T::INTTYPE: TYPE8 Position        */
#define GPIO_INTTYPE_TYPE8_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE8_Pos )                    /*!< GPIO_T::INTTYPE: TYPE8 Mask            */

#define GPIO_INTTYPE_TYPE9_Pos      ( 9 )                                                  /*!< GPIO_T::INTTYPE: TYPE9 Position        */
#define GPIO_INTTYPE_TYPE9_Msk      ( 0x1ul << GPIO_INTTYPE_TYPE9_Pos )                    /*!< GPIO_T::INTTYPE: TYPE9 Mask            */

#define GPIO_INTTYPE_TYPE10_Pos     ( 10 )                                                 /*!< GPIO_T::INTTYPE: TYPE10 Position       */
#define GPIO_INTTYPE_TYPE10_Msk     ( 0x1ul << GPIO_INTTYPE_TYPE10_Pos )                   /*!< GPIO_T::INTTYPE: TYPE10 Mask           */

