FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/gpio_reg.h
#define GPIO_INTTYPE_TYPE11_Pos     ( 11 )                                                 /*!< GPIO_T::INTTYPE: TYPE11 Position       */
#define GPIO_INTTYPE_TYPE11_Msk     ( 0x1ul << GPIO_INTTYPE_TYPE11_Pos )                   /*!< GPIO_T::INTTYPE: TYPE11 Mask           */

#define GPIO_INTTYPE_TYPE12_Pos     ( 12 )                                                 /*!< GPIO_T::INTTYPE: TYPE12 Position       */
#define GPIO_INTTYPE_TYPE12_Msk     ( 0x1ul << GPIO_INTTYPE_TYPE12_Pos )                   /*!< GPIO_T::INTTYPE: TYPE12 Mask           */

#define GPIO_INTTYPE_TYPE13_Pos     ( 13 )                                                 /*!< GPIO_T::INTTYPE: TYPE13 Position       */
#define GPIO_INTTYPE_TYPE13_Msk     ( 0x1ul << GPIO_INTTYPE_TYPE13_Pos )                   /*!< GPIO_T::INTTYPE: TYPE13 Mask           */

#define GPIO_INTTYPE_TYPE14_Pos     ( 14 )                                                 /*!< GPIO_T::INTTYPE: TYPE14 Position       */
#define GPIO_INTTYPE_TYPE14_Msk     ( 0x1ul << GPIO_INTTYPE_TYPE14_Pos )                   /*!< GPIO_T::INTTYPE: TYPE14 Mask           */

#define GPIO_INTTYPE_TYPE15_Pos     ( 15 )                                                 /*!< GPIO_T::INTTYPE: TYPE15 Position       */
#define GPIO_INTTYPE_TYPE15_Msk     ( 0x1ul << GPIO_INTTYPE_TYPE15_Pos )                   /*!< GPIO_T::INTTYPE: TYPE15 Mask           */

#define GPIO_INTEN_FLIEN0_Pos       ( 0 )                                                  /*!< GPIO_T::INTEN: FLIEN0 Position         */
#define GPIO_INTEN_FLIEN0_Msk       ( 0x1ul << GPIO_INTEN_FLIEN0_Pos )                     /*!< GPIO_T::INTEN: FLIEN0 Mask             */

#define GPIO_INTEN_FLIEN1_Pos       ( 1 )                                                  /*!< GPIO_T::INTEN: FLIEN1 Position         */
#define GPIO_INTEN_FLIEN1_Msk       ( 0x1ul << GPIO_INTEN_FLIEN1_Pos )                     /*!< GPIO_T::INTEN: FLIEN1 Mask             */

#define GPIO_INTEN_FLIEN2_Pos       ( 2 )                                                  /*!< GPIO_T::INTEN: FLIEN2 Position         */
#define GPIO_INTEN_FLIEN2_Msk       ( 0x1ul << GPIO_INTEN_FLIEN2_Pos )                     /*!< GPIO_T::INTEN: FLIEN2 Mask             */

#define GPIO_INTEN_FLIEN3_Pos       ( 3 )                                                  /*!< GPIO_T::INTEN: FLIEN3 Position         */
#define GPIO_INTEN_FLIEN3_Msk       ( 0x1ul << GPIO_INTEN_FLIEN3_Pos )                     /*!< GPIO_T::INTEN: FLIEN3 Mask             */

#define GPIO_INTEN_FLIEN4_Pos       ( 4 )                                                  /*!< GPIO_T::INTEN: FLIEN4 Position         */
#define GPIO_INTEN_FLIEN4_Msk       ( 0x1ul << GPIO_INTEN_FLIEN4_Pos )                     /*!< GPIO_T::INTEN: FLIEN4 Mask             */

#define GPIO_INTEN_FLIEN5_Pos       ( 5 )                                                  /*!< GPIO_T::INTEN: FLIEN5 Position         */
#define GPIO_INTEN_FLIEN5_Msk       ( 0x1ul << GPIO_INTEN_FLIEN5_Pos )                     /*!< GPIO_T::INTEN: FLIEN5 Mask             */

#define GPIO_INTEN_FLIEN6_Pos       ( 6 )                                                  /*!< GPIO_T::INTEN: FLIEN6 Position         */
#define GPIO_INTEN_FLIEN6_Msk       ( 0x1ul << GPIO_INTEN_FLIEN6_Pos )                     /*!< GPIO_T::INTEN: FLIEN6 Mask             */

#define GPIO_INTEN_FLIEN7_Pos       ( 7 )                                                  /*!< GPIO_T::INTEN: FLIEN7 Position         */
#define GPIO_INTEN_FLIEN7_Msk       ( 0x1ul << GPIO_INTEN_FLIEN7_Pos )                     /*!< GPIO_T::INTEN: FLIEN7 Mask             */

#define GPIO_INTEN_FLIEN8_Pos       ( 8 )                                                  /*!< GPIO_T::INTEN: FLIEN8 Position         */
#define GPIO_INTEN_FLIEN8_Msk       ( 0x1ul << GPIO_INTEN_FLIEN8_Pos )                     /*!< GPIO_T::INTEN: FLIEN8 Mask             */

#define GPIO_INTEN_FLIEN9_Pos       ( 9 )                                                  /*!< GPIO_T::INTEN: FLIEN9 Position         */
#define GPIO_INTEN_FLIEN9_Msk       ( 0x1ul << GPIO_INTEN_FLIEN9_Pos )                     /*!< GPIO_T::INTEN: FLIEN9 Mask             */

#define GPIO_INTEN_FLIEN10_Pos      ( 10 )                                                 /*!< GPIO_T::INTEN: FLIEN10 Position        */
#define GPIO_INTEN_FLIEN10_Msk      ( 0x1ul << GPIO_INTEN_FLIEN10_Pos )                    /*!< GPIO_T::INTEN: FLIEN10 Mask            */

#define GPIO_INTEN_FLIEN11_Pos      ( 11 )                                                 /*!< GPIO_T::INTEN: FLIEN11 Position        */
#define GPIO_INTEN_FLIEN11_Msk      ( 0x1ul << GPIO_INTEN_FLIEN11_Pos )                    /*!< GPIO_T::INTEN: FLIEN11 Mask            */

#define GPIO_INTEN_FLIEN12_Pos      ( 12 )                                                 /*!< GPIO_T::INTEN: FLIEN12 Position        */
#define GPIO_INTEN_FLIEN12_Msk      ( 0x1ul << GPIO_INTEN_FLIEN12_Pos )                    /*!< GPIO_T::INTEN: FLIEN12 Mask            */

#define GPIO_INTEN_FLIEN13_Pos      ( 13 )                                                 /*!< GPIO_T::INTEN: FLIEN13 Position        */
#define GPIO_INTEN_FLIEN13_Msk      ( 0x1ul << GPIO_INTEN_FLIEN13_Pos )                    /*!< GPIO_T::INTEN: FLIEN13 Mask            */

#define GPIO_INTEN_FLIEN14_Pos      ( 14 )                                                 /*!< GPIO_T::INTEN: FLIEN14 Position        */
#define GPIO_INTEN_FLIEN14_Msk      ( 0x1ul << GPIO_INTEN_FLIEN14_Pos )                    /*!< GPIO_T::INTEN: FLIEN14 Mask            */

#define GPIO_INTEN_FLIEN15_Pos      ( 15 )                                                 /*!< GPIO_T::INTEN: FLIEN15 Position        */
#define GPIO_INTEN_FLIEN15_Msk      ( 0x1ul << GPIO_INTEN_FLIEN15_Pos )                    /*!< GPIO_T::INTEN: FLIEN15 Mask            */

#define GPIO_INTEN_RHIEN0_Pos       ( 16 )                                                 /*!< GPIO_T::INTEN: RHIEN0 Position         */
#define GPIO_INTEN_RHIEN0_Msk       ( 0x1ul << GPIO_INTEN_RHIEN0_Pos )                     /*!< GPIO_T::INTEN: RHIEN0 Mask             */

#define GPIO_INTEN_RHIEN1_Pos       ( 17 )                                                 /*!< GPIO_T::INTEN: RHIEN1 Position         */
#define GPIO_INTEN_RHIEN1_Msk       ( 0x1ul << GPIO_INTEN_RHIEN1_Pos )                     /*!< GPIO_T::INTEN: RHIEN1 Mask             */

