FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/gpio_reg.h
#define GPIO_INTEN_RHIEN2_Pos       ( 18 )                                                 /*!< GPIO_T::INTEN: RHIEN2 Position         */
#define GPIO_INTEN_RHIEN2_Msk       ( 0x1ul << GPIO_INTEN_RHIEN2_Pos )                     /*!< GPIO_T::INTEN: RHIEN2 Mask             */

#define GPIO_INTEN_RHIEN3_Pos       ( 19 )                                                 /*!< GPIO_T::INTEN: RHIEN3 Position         */
#define GPIO_INTEN_RHIEN3_Msk       ( 0x1ul << GPIO_INTEN_RHIEN3_Pos )                     /*!< GPIO_T::INTEN: RHIEN3 Mask             */

#define GPIO_INTEN_RHIEN4_Pos       ( 20 )                                                 /*!< GPIO_T::INTEN: RHIEN4 Position         */
#define GPIO_INTEN_RHIEN4_Msk       ( 0x1ul << GPIO_INTEN_RHIEN4_Pos )                     /*!< GPIO_T::INTEN: RHIEN4 Mask             */

#define GPIO_INTEN_RHIEN5_Pos       ( 21 )                                                 /*!< GPIO_T::INTEN: RHIEN5 Position         */
#define GPIO_INTEN_RHIEN5_Msk       ( 0x1ul << GPIO_INTEN_RHIEN5_Pos )                     /*!< GPIO_T::INTEN: RHIEN5 Mask             */

#define GPIO_INTEN_RHIEN6_Pos       ( 22 )                                                 /*!< GPIO_T::INTEN: RHIEN6 Position         */
#define GPIO_INTEN_RHIEN6_Msk       ( 0x1ul << GPIO_INTEN_RHIEN6_Pos )                     /*!< GPIO_T::INTEN: RHIEN6 Mask             */

#define GPIO_INTEN_RHIEN7_Pos       ( 23 )                                                 /*!< GPIO_T::INTEN: RHIEN7 Position         */
#define GPIO_INTEN_RHIEN7_Msk       ( 0x1ul << GPIO_INTEN_RHIEN7_Pos )                     /*!< GPIO_T::INTEN: RHIEN7 Mask             */

#define GPIO_INTEN_RHIEN8_Pos       ( 24 )                                                 /*!< GPIO_T::INTEN: RHIEN8 Position         */
#define GPIO_INTEN_RHIEN8_Msk       ( 0x1ul << GPIO_INTEN_RHIEN8_Pos )                     /*!< GPIO_T::INTEN: RHIEN8 Mask             */

#define GPIO_INTEN_RHIEN9_Pos       ( 25 )                                                 /*!< GPIO_T::INTEN: RHIEN9 Position         */
#define GPIO_INTEN_RHIEN9_Msk       ( 0x1ul << GPIO_INTEN_RHIEN9_Pos )                     /*!< GPIO_T::INTEN: RHIEN9 Mask             */

#define GPIO_INTEN_RHIEN10_Pos      ( 26 )                                                 /*!< GPIO_T::INTEN: RHIEN10 Position        */
#define GPIO_INTEN_RHIEN10_Msk      ( 0x1ul << GPIO_INTEN_RHIEN10_Pos )                    /*!< GPIO_T::INTEN: RHIEN10 Mask            */

#define GPIO_INTEN_RHIEN11_Pos      ( 27 )                                                 /*!< GPIO_T::INTEN: RHIEN11 Position        */
#define GPIO_INTEN_RHIEN11_Msk      ( 0x1ul << GPIO_INTEN_RHIEN11_Pos )                    /*!< GPIO_T::INTEN: RHIEN11 Mask            */

#define GPIO_INTEN_RHIEN12_Pos      ( 28 )                                                 /*!< GPIO_T::INTEN: RHIEN12 Position        */
#define GPIO_INTEN_RHIEN12_Msk      ( 0x1ul << GPIO_INTEN_RHIEN12_Pos )                    /*!< GPIO_T::INTEN: RHIEN12 Mask            */

#define GPIO_INTEN_RHIEN13_Pos      ( 29 )                                                 /*!< GPIO_T::INTEN: RHIEN13 Position        */
#define GPIO_INTEN_RHIEN13_Msk      ( 0x1ul << GPIO_INTEN_RHIEN13_Pos )                    /*!< GPIO_T::INTEN: RHIEN13 Mask            */

#define GPIO_INTEN_RHIEN14_Pos      ( 30 )                                                 /*!< GPIO_T::INTEN: RHIEN14 Position        */
#define GPIO_INTEN_RHIEN14_Msk      ( 0x1ul << GPIO_INTEN_RHIEN14_Pos )                    /*!< GPIO_T::INTEN: RHIEN14 Mask            */

#define GPIO_INTEN_RHIEN15_Pos      ( 31 )                                                 /*!< GPIO_T::INTEN: RHIEN15 Position        */
#define GPIO_INTEN_RHIEN15_Msk      ( 0x1ul << GPIO_INTEN_RHIEN15_Pos )                    /*!< GPIO_T::INTEN: RHIEN15 Mask            */

#define GPIO_INTSRC_INTSRC0_Pos     ( 0 )                                                  /*!< GPIO_T::INTSRC: INTSRC0 Position       */
#define GPIO_INTSRC_INTSRC0_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC0_Pos )                   /*!< GPIO_T::INTSRC: INTSRC0 Mask           */

#define GPIO_INTSRC_INTSRC1_Pos     ( 1 )                                                  /*!< GPIO_T::INTSRC: INTSRC1 Position       */
#define GPIO_INTSRC_INTSRC1_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC1_Pos )                   /*!< GPIO_T::INTSRC: INTSRC1 Mask           */

#define GPIO_INTSRC_INTSRC2_Pos     ( 2 )                                                  /*!< GPIO_T::INTSRC: INTSRC2 Position       */
#define GPIO_INTSRC_INTSRC2_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC2_Pos )                   /*!< GPIO_T::INTSRC: INTSRC2 Mask           */

#define GPIO_INTSRC_INTSRC3_Pos     ( 3 )                                                  /*!< GPIO_T::INTSRC: INTSRC3 Position       */
#define GPIO_INTSRC_INTSRC3_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC3_Pos )                   /*!< GPIO_T::INTSRC: INTSRC3 Mask           */

#define GPIO_INTSRC_INTSRC4_Pos     ( 4 )                                                  /*!< GPIO_T::INTSRC: INTSRC4 Position       */
#define GPIO_INTSRC_INTSRC4_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC4_Pos )                   /*!< GPIO_T::INTSRC: INTSRC4 Mask           */

#define GPIO_INTSRC_INTSRC5_Pos     ( 5 )                                                  /*!< GPIO_T::INTSRC: INTSRC5 Position       */
#define GPIO_INTSRC_INTSRC5_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC5_Pos )                   /*!< GPIO_T::INTSRC: INTSRC5 Mask           */

#define GPIO_INTSRC_INTSRC6_Pos     ( 6 )                                                  /*!< GPIO_T::INTSRC: INTSRC6 Position       */
#define GPIO_INTSRC_INTSRC6_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC6_Pos )                   /*!< GPIO_T::INTSRC: INTSRC6 Mask           */

#define GPIO_INTSRC_INTSRC7_Pos     ( 7 )                                                  /*!< GPIO_T::INTSRC: INTSRC7 Position       */
#define GPIO_INTSRC_INTSRC7_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC7_Pos )                   /*!< GPIO_T::INTSRC: INTSRC7 Mask           */

#define GPIO_INTSRC_INTSRC8_Pos     ( 8 )                                                  /*!< GPIO_T::INTSRC: INTSRC8 Position       */
#define GPIO_INTSRC_INTSRC8_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC8_Pos )                   /*!< GPIO_T::INTSRC: INTSRC8 Mask           */

#define GPIO_INTSRC_INTSRC9_Pos     ( 9 )                                                  /*!< GPIO_T::INTSRC: INTSRC9 Position       */
#define GPIO_INTSRC_INTSRC9_Msk     ( 0x1ul << GPIO_INTSRC_INTSRC9_Pos )                   /*!< GPIO_T::INTSRC: INTSRC9 Mask           */

#define GPIO_INTSRC_INTSRC10_Pos    ( 10 )                                                 /*!< GPIO_T::INTSRC: INTSRC10 Position      */
#define GPIO_INTSRC_INTSRC10_Msk    ( 0x1ul << GPIO_INTSRC_INTSRC10_Pos )                  /*!< GPIO_T::INTSRC: INTSRC10 Mask          */

#define GPIO_INTSRC_INTSRC11_Pos    ( 11 )                                                 /*!< GPIO_T::INTSRC: INTSRC11 Position      */
#define GPIO_INTSRC_INTSRC11_Msk    ( 0x1ul << GPIO_INTSRC_INTSRC11_Pos )                  /*!< GPIO_T::INTSRC: INTSRC11 Mask          */

#define GPIO_INTSRC_INTSRC12_Pos    ( 12 )                                                 /*!< GPIO_T::INTSRC: INTSRC12 Position      */
#define GPIO_INTSRC_INTSRC12_Msk    ( 0x1ul << GPIO_INTSRC_INTSRC12_Pos )                  /*!< GPIO_T::INTSRC: INTSRC12 Mask          */

#define GPIO_INTSRC_INTSRC13_Pos    ( 13 )                                                 /*!< GPIO_T::INTSRC: INTSRC13 Position      */
#define GPIO_INTSRC_INTSRC13_Msk    ( 0x1ul << GPIO_INTSRC_INTSRC13_Pos )                  /*!< GPIO_T::INTSRC: INTSRC13 Mask          */

#define GPIO_INTSRC_INTSRC14_Pos    ( 14 )                                                 /*!< GPIO_T::INTSRC: INTSRC14 Position      */
#define GPIO_INTSRC_INTSRC14_Msk    ( 0x1ul << GPIO_INTSRC_INTSRC14_Pos )                  /*!< GPIO_T::INTSRC: INTSRC14 Mask          */

#define GPIO_INTSRC_INTSRC15_Pos    ( 15 )                                                 /*!< GPIO_T::INTSRC: INTSRC15 Position      */
#define GPIO_INTSRC_INTSRC15_Msk    ( 0x1ul << GPIO_INTSRC_INTSRC15_Pos )                  /*!< GPIO_T::INTSRC: INTSRC15 Mask          */

#define GPIO_SMTEN_SMTEN0_Pos       ( 0 )                                                  /*!< GPIO_T::SMTEN: SMTEN0 Position         */
#define GPIO_SMTEN_SMTEN0_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN0_Pos )                     /*!< GPIO_T::SMTEN: SMTEN0 Mask             */

#define GPIO_SMTEN_SMTEN1_Pos       ( 1 )                                                  /*!< GPIO_T::SMTEN: SMTEN1 Position         */
#define GPIO_SMTEN_SMTEN1_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN1_Pos )                     /*!< GPIO_T::SMTEN: SMTEN1 Mask             */

#define GPIO_SMTEN_SMTEN2_Pos       ( 2 )                                                  /*!< GPIO_T::SMTEN: SMTEN2 Position         */
#define GPIO_SMTEN_SMTEN2_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN2_Pos )                     /*!< GPIO_T::SMTEN: SMTEN2 Mask             */

