FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/gpio_reg.h
#define GPIO_SMTEN_SMTEN3_Pos       ( 3 )                                                  /*!< GPIO_T::SMTEN: SMTEN3 Position         */
#define GPIO_SMTEN_SMTEN3_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN3_Pos )                     /*!< GPIO_T::SMTEN: SMTEN3 Mask             */

#define GPIO_SMTEN_SMTEN4_Pos       ( 4 )                                                  /*!< GPIO_T::SMTEN: SMTEN4 Position         */
#define GPIO_SMTEN_SMTEN4_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN4_Pos )                     /*!< GPIO_T::SMTEN: SMTEN4 Mask             */

#define GPIO_SMTEN_SMTEN5_Pos       ( 5 )                                                  /*!< GPIO_T::SMTEN: SMTEN5 Position         */
#define GPIO_SMTEN_SMTEN5_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN5_Pos )                     /*!< GPIO_T::SMTEN: SMTEN5 Mask             */

#define GPIO_SMTEN_SMTEN6_Pos       ( 6 )                                                  /*!< GPIO_T::SMTEN: SMTEN6 Position         */
#define GPIO_SMTEN_SMTEN6_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN6_Pos )                     /*!< GPIO_T::SMTEN: SMTEN6 Mask             */

#define GPIO_SMTEN_SMTEN7_Pos       ( 7 )                                                  /*!< GPIO_T::SMTEN: SMTEN7 Position         */
#define GPIO_SMTEN_SMTEN7_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN7_Pos )                     /*!< GPIO_T::SMTEN: SMTEN7 Mask             */

#define GPIO_SMTEN_SMTEN8_Pos       ( 8 )                                                  /*!< GPIO_T::SMTEN: SMTEN8 Position         */
#define GPIO_SMTEN_SMTEN8_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN8_Pos )                     /*!< GPIO_T::SMTEN: SMTEN8 Mask             */

#define GPIO_SMTEN_SMTEN9_Pos       ( 9 )                                                  /*!< GPIO_T::SMTEN: SMTEN9 Position         */
#define GPIO_SMTEN_SMTEN9_Msk       ( 0x1ul << GPIO_SMTEN_SMTEN9_Pos )                     /*!< GPIO_T::SMTEN: SMTEN9 Mask             */

#define GPIO_SMTEN_SMTEN10_Pos      ( 10 )                                                 /*!< GPIO_T::SMTEN: SMTEN10 Position        */
#define GPIO_SMTEN_SMTEN10_Msk      ( 0x1ul << GPIO_SMTEN_SMTEN10_Pos )                    /*!< GPIO_T::SMTEN: SMTEN10 Mask            */

#define GPIO_SMTEN_SMTEN11_Pos      ( 11 )                                                 /*!< GPIO_T::SMTEN: SMTEN11 Position        */
#define GPIO_SMTEN_SMTEN11_Msk      ( 0x1ul << GPIO_SMTEN_SMTEN11_Pos )                    /*!< GPIO_T::SMTEN: SMTEN11 Mask            */

#define GPIO_SMTEN_SMTEN12_Pos      ( 12 )                                                 /*!< GPIO_T::SMTEN: SMTEN12 Position        */
#define GPIO_SMTEN_SMTEN12_Msk      ( 0x1ul << GPIO_SMTEN_SMTEN12_Pos )                    /*!< GPIO_T::SMTEN: SMTEN12 Mask            */

#define GPIO_SMTEN_SMTEN13_Pos      ( 13 )                                                 /*!< GPIO_T::SMTEN: SMTEN13 Position        */
#define GPIO_SMTEN_SMTEN13_Msk      ( 0x1ul << GPIO_SMTEN_SMTEN13_Pos )                    /*!< GPIO_T::SMTEN: SMTEN13 Mask            */

#define GPIO_SMTEN_SMTEN14_Pos      ( 14 )                                                 /*!< GPIO_T::SMTEN: SMTEN14 Position        */
#define GPIO_SMTEN_SMTEN14_Msk      ( 0x1ul << GPIO_SMTEN_SMTEN14_Pos )                    /*!< GPIO_T::SMTEN: SMTEN14 Mask            */

#define GPIO_SMTEN_SMTEN15_Pos      ( 15 )                                                 /*!< GPIO_T::SMTEN: SMTEN15 Position        */
#define GPIO_SMTEN_SMTEN15_Msk      ( 0x1ul << GPIO_SMTEN_SMTEN15_Pos )                    /*!< GPIO_T::SMTEN: SMTEN15 Mask            */

#define GPIO_SLEWCTL_HSREN0_Pos     ( 0 )                                                  /*!< GPIO_T::SLEWCTL: HSREN0 Position       */
#define GPIO_SLEWCTL_HSREN0_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN0_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN0 Mask           */

#define GPIO_SLEWCTL_HSREN1_Pos     ( 1 )                                                  /*!< GPIO_T::SLEWCTL: HSREN1 Position       */
#define GPIO_SLEWCTL_HSREN1_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN1_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN1 Mask           */

#define GPIO_SLEWCTL_HSREN2_Pos     ( 2 )                                                  /*!< GPIO_T::SLEWCTL: HSREN2 Position       */
#define GPIO_SLEWCTL_HSREN2_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN2_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN2 Mask           */

#define GPIO_SLEWCTL_HSREN3_Pos     ( 3 )                                                  /*!< GPIO_T::SLEWCTL: HSREN3 Position       */
#define GPIO_SLEWCTL_HSREN3_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN3_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN3 Mask           */

#define GPIO_SLEWCTL_HSREN4_Pos     ( 4 )                                                  /*!< GPIO_T::SLEWCTL: HSREN4 Position       */
#define GPIO_SLEWCTL_HSREN4_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN4_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN4 Mask           */

#define GPIO_SLEWCTL_HSREN5_Pos     ( 5 )                                                  /*!< GPIO_T::SLEWCTL: HSREN5 Position       */
#define GPIO_SLEWCTL_HSREN5_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN5_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN5 Mask           */

#define GPIO_SLEWCTL_HSREN6_Pos     ( 6 )                                                  /*!< GPIO_T::SLEWCTL: HSREN6 Position       */
#define GPIO_SLEWCTL_HSREN6_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN6_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN6 Mask           */

#define GPIO_SLEWCTL_HSREN7_Pos     ( 7 )                                                  /*!< GPIO_T::SLEWCTL: HSREN7 Position       */
#define GPIO_SLEWCTL_HSREN7_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN7_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN7 Mask           */

#define GPIO_SLEWCTL_HSREN8_Pos     ( 8 )                                                  /*!< GPIO_T::SLEWCTL: HSREN8 Position       */
#define GPIO_SLEWCTL_HSREN8_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN8_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN8 Mask           */

#define GPIO_SLEWCTL_HSREN9_Pos     ( 9 )                                                  /*!< GPIO_T::SLEWCTL: HSREN9 Position       */
#define GPIO_SLEWCTL_HSREN9_Msk     ( 0x1ul << GPIO_SLEWCTL_HSREN9_Pos )                   /*!< GPIO_T::SLEWCTL: HSREN9 Mask           */

