FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/gpio_reg.h
#define GPIO_SLEWCTL_HSREN10_Pos    ( 10 )                                                 /*!< GPIO_T::SLEWCTL: HSREN10 Position      */
#define GPIO_SLEWCTL_HSREN10_Msk    ( 0x1ul << GPIO_SLEWCTL_HSREN10_Pos )                  /*!< GPIO_T::SLEWCTL: HSREN10 Mask          */

#define GPIO_SLEWCTL_HSREN11_Pos    ( 11 )                                                 /*!< GPIO_T::SLEWCTL: HSREN11 Position      */
#define GPIO_SLEWCTL_HSREN11_Msk    ( 0x1ul << GPIO_SLEWCTL_HSREN11_Pos )                  /*!< GPIO_T::SLEWCTL: HSREN11 Mask          */

#define GPIO_SLEWCTL_HSREN12_Pos    ( 12 )                                                 /*!< GPIO_T::SLEWCTL: HSREN12 Position      */
#define GPIO_SLEWCTL_HSREN12_Msk    ( 0x1ul << GPIO_SLEWCTL_HSREN12_Pos )                  /*!< GPIO_T::SLEWCTL: HSREN12 Mask          */

#define GPIO_SLEWCTL_HSREN13_Pos    ( 13 )                                                 /*!< GPIO_T::SLEWCTL: HSREN13 Position      */
#define GPIO_SLEWCTL_HSREN13_Msk    ( 0x1ul << GPIO_SLEWCTL_HSREN13_Pos )                  /*!< GPIO_T::SLEWCTL: HSREN13 Mask          */

#define GPIO_SLEWCTL_HSREN14_Pos    ( 14 )                                                 /*!< GPIO_T::SLEWCTL: HSREN14 Position      */
#define GPIO_SLEWCTL_HSREN14_Msk    ( 0x1ul << GPIO_SLEWCTL_HSREN14_Pos )                  /*!< GPIO_T::SLEWCTL: HSREN14 Mask          */

#define GPIO_SLEWCTL_HSREN15_Pos    ( 15 )                                                 /*!< GPIO_T::SLEWCTL: HSREN15 Position      */
#define GPIO_SLEWCTL_HSREN15_Msk    ( 0x1ul << GPIO_SLEWCTL_HSREN15_Pos )                  /*!< GPIO_T::SLEWCTL: HSREN15 Mask          */

#define GPIO_PUSEL_PUSEL0_Pos       ( 0 )                                                  /*!< GPIO_T::PUSEL: PUSEL0 Position         */
#define GPIO_PUSEL_PUSEL0_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL0_Pos )                     /*!< GPIO_T::PUSEL: PUSEL0 Mask             */

#define GPIO_PUSEL_PUSEL1_Pos       ( 2 )                                                  /*!< GPIO_T::PUSEL: PUSEL1 Position         */
#define GPIO_PUSEL_PUSEL1_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL1_Pos )                     /*!< GPIO_T::PUSEL: PUSEL1 Mask             */

#define GPIO_PUSEL_PUSEL2_Pos       ( 4 )                                                  /*!< GPIO_T::PUSEL: PUSEL2 Position         */
#define GPIO_PUSEL_PUSEL2_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL2_Pos )                     /*!< GPIO_T::PUSEL: PUSEL2 Mask             */

#define GPIO_PUSEL_PUSEL3_Pos       ( 6 )                                                  /*!< GPIO_T::PUSEL: PUSEL3 Position         */
#define GPIO_PUSEL_PUSEL3_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL3_Pos )                     /*!< GPIO_T::PUSEL: PUSEL3 Mask             */

#define GPIO_PUSEL_PUSEL4_Pos       ( 8 )                                                  /*!< GPIO_T::PUSEL: PUSEL4 Position         */
#define GPIO_PUSEL_PUSEL4_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL4_Pos )                     /*!< GPIO_T::PUSEL: PUSEL4 Mask             */

#define GPIO_PUSEL_PUSEL5_Pos       ( 10 )                                                 /*!< GPIO_T::PUSEL: PUSEL5 Position         */
#define GPIO_PUSEL_PUSEL5_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL5_Pos )                     /*!< GPIO_T::PUSEL: PUSEL5 Mask             */

#define GPIO_PUSEL_PUSEL6_Pos       ( 12 )                                                 /*!< GPIO_T::PUSEL: PUSEL6 Position         */
#define GPIO_PUSEL_PUSEL6_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL6_Pos )                     /*!< GPIO_T::PUSEL: PUSEL6 Mask             */

#define GPIO_PUSEL_PUSEL7_Pos       ( 14 )                                                 /*!< GPIO_T::PUSEL: PUSEL7 Position         */
#define GPIO_PUSEL_PUSEL7_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL7_Pos )                     /*!< GPIO_T::PUSEL: PUSEL7 Mask             */

#define GPIO_PUSEL_PUSEL8_Pos       ( 16 )                                                 /*!< GPIO_T::PUSEL: PUSEL8 Position         */
#define GPIO_PUSEL_PUSEL8_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL8_Pos )                     /*!< GPIO_T::PUSEL: PUSEL8 Mask             */

#define GPIO_PUSEL_PUSEL9_Pos       ( 18 )                                                 /*!< GPIO_T::PUSEL: PUSEL9 Position         */
#define GPIO_PUSEL_PUSEL9_Msk       ( 0x3ul << GPIO_PUSEL_PUSEL9_Pos )                     /*!< GPIO_T::PUSEL: PUSEL9 Mask             */

#define GPIO_PUSEL_PUSEL10_Pos      ( 20 )                                                 /*!< GPIO_T::PUSEL: PUSEL10 Position        */
#define GPIO_PUSEL_PUSEL10_Msk      ( 0x3ul << GPIO_PUSEL_PUSEL10_Pos )                    /*!< GPIO_T::PUSEL: PUSEL10 Mask            */

#define GPIO_PUSEL_PUSEL11_Pos      ( 22 )                                                 /*!< GPIO_T::PUSEL: PUSEL11 Position        */
#define GPIO_PUSEL_PUSEL11_Msk      ( 0x3ul << GPIO_PUSEL_PUSEL11_Pos )                    /*!< GPIO_T::PUSEL: PUSEL11 Mask            */

#define GPIO_PUSEL_PUSEL12_Pos      ( 24 )                                                 /*!< GPIO_T::PUSEL: PUSEL12 Position        */
#define GPIO_PUSEL_PUSEL12_Msk      ( 0x3ul << GPIO_PUSEL_PUSEL12_Pos )                    /*!< GPIO_T::PUSEL: PUSEL12 Mask            */

#define GPIO_PUSEL_PUSEL13_Pos      ( 26 )                                                 /*!< GPIO_T::PUSEL: PUSEL13 Position        */
#define GPIO_PUSEL_PUSEL13_Msk      ( 0x3ul << GPIO_PUSEL_PUSEL13_Pos )                    /*!< GPIO_T::PUSEL: PUSEL13 Mask            */

#define GPIO_PUSEL_PUSEL14_Pos      ( 28 )                                                 /*!< GPIO_T::PUSEL: PUSEL14 Position        */
#define GPIO_PUSEL_PUSEL14_Msk      ( 0x3ul << GPIO_PUSEL_PUSEL14_Pos )                    /*!< GPIO_T::PUSEL: PUSEL14 Mask            */

#define GPIO_PUSEL_PUSEL15_Pos      ( 30 )                                                 /*!< GPIO_T::PUSEL: PUSEL15 Position        */
#define GPIO_PUSEL_PUSEL15_Msk      ( 0x3ul << GPIO_PUSEL_PUSEL15_Pos )                    /*!< GPIO_T::PUSEL: PUSEL15 Mask            */

#define GPIO_DBCTL_DBCLKSEL_Pos     ( 0 )                                                  /*!< GPIO_T::DBCTL: DBCLKSEL Position       */
#define GPIO_DBCTL_DBCLKSEL_Msk     ( 0xful << GPIO_DBCTL_DBCLKSEL_Pos )                   /*!< GPIO_T::DBCTL: DBCLKSEL Mask           */

#define GPIO_DBCTL_DBCLKSRC_Pos     ( 4 )                                                  /*!< GPIO_T::DBCTL: DBCLKSRC Position       */
#define GPIO_DBCTL_DBCLKSRC_Msk     ( 0x1ul << GPIO_DBCTL_DBCLKSRC_Pos )                   /*!< GPIO_T::DBCTL: DBCLKSRC Mask           */

#define GPIO_DBCTL_ICLKON_Pos       ( 5 )                                                  /*!< GPIO_T::DBCTL: ICLKON Position         */
#define GPIO_DBCTL_ICLKON_Msk       ( 0x1ul << GPIO_DBCTL_ICLKON_Pos )                     /*!< GPIO_T::DBCTL: ICLKON Mask             */


/**@}*/ /* GPIO_CONST */
/**@}*/ /* end of GPIO register group */
/**@}*/ /* end of REGISTER group */


#endif /* __GPIO_REG_H__ */
